<template>
  <div class="page">
    <!--<div v-html="docs" class="docs" v-if="docs"></div>-->
    <div v-html="docs" class="docs" v-if="docs"></div>
    <div class="docs-box" v-if="type=='user'">
      <h1>比财服务协议</h1>
      <h3>(V1.0版）</h3>
      <h3>重要提示：</h3>
      <p>
        北京比财数据科技有限公司(以下简称“比财"或“我们”)依据本《比财服务协议》(以下简称“本协议”)的规定为用户(以下有时也称“您”)提供服务，本协议在用户和比财间具有合同上的法律效力。比财在此特别提醒用户认真阅读、充分理解本协议各条款，特别是其中所涉及的免除、减轻比财责任的条款、对用户权利限制条款、争议解决和法律适用等。其中，限制、免责条款可能以黑体加粗的形式提示您重点注意。请用户审慎阅读本协议(未成年人应在监护人陪同下阅读)。除非用户接受本协议所有条款，否则用户无权使用比财于本协议下所提供的服务。用户一经注册或使用比财服务即视为对本协议所有条款的理解和接受。</p>
      <h4>一、关于比财服务协议的确认和接纳</h4>
      <p>(一)
        比财服务，是指由比财通过比财客户服务渠道为用户提供的一站式便捷理财服务，包括但不限于金融机构及其理财产品的查询、比价、购买、赎回、记账等服务。比财客户服务渠道是指比财自有渠道(如：比财客户端、官方网站、公众号等)及第三方机构合作渠道，包括但不限于电子渠道。</p>
      <p>(二)
        比财有权在必要时单方修改或变更本协议的内容，并按法律规定公示，请您随时关注比财客户服务渠道公布的最新服务协议。若您于任何修改或变更本协议条款后继续使用比财服务，则视为您已阅读、了解并同意接受修改或变更。若您不同意，则请您主动立即停用比财服务。</p>
      <p>(三)如您所属的国家或地区排除本协议的全部或部分内容，请您立即停止使用比财服务，否则，若您继续使用比财服务，由此引起的法律风险或法律责任均由您自行承担。</p>
      <p>(四)您同意并授权比财在提供服务前和服务期间向有权机关或组织查询或核实您的相应信息。</p>
      <h4>二、关于比财服务</h4>
      <p>(一) 您自愿使用比财服务，同意遵守国家有关金融法律法规、政策及比财的有关业务规章制度。</p>
      <p>(二)
        您在注册和使用比财服务过程中，可能需要提供一些必要的信息，您须保证所填写的信息和提供的资料是合法、真实、有效及完整的(包括但不限于身份证、户口本、护照等身份证明，联系方式、从事职业、通讯地址、QQ号码、微信账号、手机号码、邮箱等个人信息)。</p>
      比财有权依据其相关规则及自身独立判断，决定是否接受您成为比财的用户或提供比财服务的部分或全部功能。同时，您应维护并及时更新您的上述资料，确保其合法、真实、有效及完整。若您提供任何错误、虚假、失效、过期或不完整的资料，或者比财有合理的理由怀疑资料错误、虚假、失效、过期或不完整，比财有权拒绝您使用比财服务的部分或全部功能。
      (三) 如因您未及时更新您的上述资料导致比财服务无法正常提供或提供时发生任何错误，您应自行承担由此造成的损失，比财不承担任何责任。
      (四) 您使用比财服务时，比财将使用电子方式向您发出通知，上述电子方式包括但不限于向您的微信、电子邮箱、手机号码、QQ号码发送信息或通过比财客户服务渠道公布等方式。
      (五) 一般情况下，您可随时浏览自己提交的信息，但出于安全性和身份识别等方面的考虑，身份证件等敏感信息可能进行部分掩码隐藏，同时，您可能无法修改注册或激活时提供的某些信息。
      <h4>三、关于比财服务的使用</h4>
      <h5>(一) 比财服务说明</h5>
      <p>1.一旦您使用比财服务，比财将根据您在比财客户服务渠道发出的指令进行相应操作。</p>
      <p>2.您在此确认，您通过比财服务流程所确认的交易状态将视为您本人的操作，操作所产生的电子信息记录均为您行为的有效凭据。您对此所进行的一切活动负全部责任。</p>
      <p>3.如您在使用比财服务时涉及第三方提供的产品或服务，比财对您与第三方可能出现的纠纷概不承担责任。如您未能及时对交易状态进行修改或确认或未能提交相关申请所引起的任何纠纷或损失由您本人负责。</p>
      <p>4.您在使用比财服务时，应自行谨慎判断相关金融产品或服务的属性及风险，并自行决定是否进行交易，且您应自行承担与此相关的所有风险。</p>
      <p>5.您认同交易过程中的资金流转需要一定的时间，您同意比财对此不承担责任。</p>
      <p>6.您同意，比财无须对您使用比财服务期间由比财保管的款项的货币贬值、汇率波动或投资亏损造成的损失承担任何责任。</p>
      <p>7.如您使用比财服务的，您应对自身所关联的银行账户拥有合法的使用权，如您因故对银行账户丧失使用权的，比财有权停止为您的上述银行账户继续提供比财服务。</p>
      <p> 8.您理解，比财有权不进行事先通知即按照公安、检察、法院、海关、税务及其他有权机关的要求对您在比财的资金及账户等进行查询、冻结或扣划。
      </p>
      <p> 9.如您是中华人民共和国以外用户，您需全面了解并遵守您所在司法辖区与使用比财服务所有相关法律、法规及规则。
      </p>
      <p> 10.您了解，如您在使用比财服务过程中，由于您的银行账户被盗用或冒用造成您的资金损失，需由您本人承担，比财将为您向相关责任第三方或赔付机构进行追偿提供必要协助。您与比财另有约定的除外。
      </p>
      <p>
        11.您同意，为了向您提供更为专业、便捷的比财服务，您不可撤销地授权比财有权向您推送比财最新服务消息或通知，并基于比财服务开展的实际需要，在比财内部平台以及比财关联企业或因服务必要而开展合作或委托的合作伙伴共享您的用户信息，详见《北京比财数据科技有限公司隐私政策》。比财将依法自行并要求关联企业或合伙伙伴保守您的用户信息及商业秘密，不对外泄漏，但法律法规、监管机构另有规定或您与比财另有约定的除外。
      </p>
      <p>
        12.为更安全、有效地向您提供服务，根据法律法规的规定，或比财需识别您的身份，或比财认为您的账户存在风险时，比财有权要求您提交身份信息，包括身份证、户口本、护照等证件或其他能识别证明您身份的合法文件，或增加核实您身份的其它措施。
      </p>
      <h5>(二)一般服务条款</h5>
      <p> 1.您在安装比财客户端或通过比财网站、公众号、第三方合作渠道等登录比财后，可按照比财的业务管理规则及要求使用比财服务(具体服务和功能以比财实际提供的为准)。
      </p>
      <p> 2.您可以使用比财服务进行相关交易，比财将会妥善保管您的资金。
      </p>
      <p>3.交易异常处理：</p>
      <p> (1) 您了解并同意于使用比财服务时，由于银行本身系统问题、相关作业网络连线问题或其他不可抗拒因素，将可能造成服务无法正常提供。
      </p>
      <p> (2) 您确认您所输入的个人基本资料无误，以便比财能于上述异常状况发生时，通知您该笔交易后续处理方式。若您所提供的基本资料有误，造成比财于上述异常状况发生时，无法及时通知您后续处理方式，比财对此将不承担任何责任。
      </p>
      <p>
        4.服务功能调整：您同意比财为保证自主业务经营权可以暂时提供部分服务功能，或于将来暂停部分服务功能或开通新的服务功能，当任何功能减少或者增加或者变化时，只要您仍然使用比财服务，即表示您同意本协议或者本协议修正后的条款。您同意比财在单方通知您后，将本协议下部分或全部服务转交由第三方运营或履行。具体受让主体以比财通知的为准。
      </p>
      <h4> 四、暂停、中止、终止或拒绝比财服务
      </h4>
      <h5> (一) 您同意，发生下列情形之一的，比财有权不进行事先通知即可暂停、中止、终止或拒绝向您提供比财服务;
      </h5>
      <p> 1.您提供的个人资料不真实，且未能提供合理说明及证明;
      </p>
      <p> 2.比财基于自身独立判断或第三方举报或投诉，认为您已违反相关法律、法规、规章及政府规范性文件；
      </p>
      <p> 3.比财基于自身独立判断或第三方举报或投诉，认为您已违反本协议约定或银行账户服务协议或比财服务中的相关产品协议;
      </p>
      <p> 4.公安、法院、监管机构等有权机关向比财发出要求；
      </p>
      <p> 5.您使用比财服务所关联的银行账户被注销、冻结、余额不足或出现交易异常等；6.比财认为存在安全隐患的其他情形。
      </p>
      <p>
        如比财按照上述规定采取相关措施，则比财有权通过微信、电话、QQ、邮件等您注册或激活比财账户时或您使用比财服务时预留的联系方式或通过比财客户服务渠道通知您，如果您预留的联系方式错误、虚假或失效，比财则不保证您能够收到或者及时收到上述通知。
      </p>
      <h5> (二)
        您理解并同意，比财有权自主决定经营策略。在符合法律法规的前提下，在比财发生合并、分立、收购、资产转让等经营变更情形时，比财有权自主向第三方转让本服务及其相关资产；比财也可在单方通知您后，将本协议下部分或全部服务转交由第三方运营或履行。具体受让主体以比财通知的为准。
      </h5>
      <h4> 五、账户及其密码和安全性
      </h4>
      <p> 您了解并同意您通过在比财注册的账户使用比财服务，应确保上述账户及其密码（或验证码）的安全。您将对利用上述账户及其密码（或验证码）所进行的一切行为负完全责任，并同意以下事项:
      </p>
      <p> (一)
        您应严格按照比财服务协议保管好您的比财账户及绑定的银行账户，妥善保密您的账户交易密码、动态密码、个人有效身份证件、绑定账户、绑定手机号码及手机设备等，不得私下买卖、出租、转让或赠予您的账户，不对其他任何人泄露您的账户、密码等身份信息，亦不得使用其他任何人的账户、密码等身份信息。所有通过您的比财账户和密码进行的任何操作、发出的任何指令均视为您本人做出。
      </p>
      <p> (二)
        您同意如发现有第三人冒用或盗用您在比财绑定的银行账户、密码和安全证书或其他任何未经您合法授权使用的情形，您应立即以有效方式通知比财及银行。比财在接受您的有效通知后，会及时封存系统留存的电子信息。对第三人以您的银行账户使用比财服务已发生的效力，除非可证明比财存在故意或重大过失，否则比财将不承担任何责任。
      </p>
      <p> (三) 当您的比财服务使用完毕后，您应安全退出。如因您未按照本协议的约定使用比财服务而导致的相关损失，由您自行承担。
      </p>
      <p> (四)
        因您泄露或丢失账户交易密码、动态密码、验证码等身份认证信息或手机、电脑或其他终端设备等，或非因比财引起的其他原因(包括但不限于您点击钓鱼链接，您使用的手机、电脑或其他终端设备、软件、系统、硬件和通信线路出现故障或被他人侵入等情况)导致的损失均由您自行承担。
      </p>
      <h4> 六、用户的守法义务及承诺
      </h4>
      <p> (一) 您承诺绝不为任何非法目的或以任何非法方式使用比财服务，并承诺遵守中华人民共和国相关法律、法规及一切使用互联网及支付服务的惯例。您若是中华人民共和国以外的用户，您还需同时遵守您所属国家或地域的法律。
      </p>
      <p> (二) 您同意并保证不得利用比财服务从事下列任何行为，否则，您应自行承担所有法律责任：
      </p>
      <p> 1. 反对宪法所确定的基本原则，危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一的;
      </p>
      <p> 2. 侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权、其他知识产权及其他合法权益；
      </p>
      <p> 3. 违反依法律或本协议所应负的保密义务；
      </p>
      <p> 4. 冒用他人名义使用比财服务;
      </p>
      <p> 5. 从事任何不法交易行为，如贩卖枪支、毒品、禁药、盗版软件、黄色淫秽物品或其他违禁物;
      </p>
      <p> 6. 提供赌博资讯或以任何方式引诱他人参与赌博；
      </p>
      <p> 7. 涉嫌洗钱、恐怖融资、套现、发布恐怖信息或进行传销活动的;
      </p>
      <p> 8. 使用无效银行账户或他人银行账户交易；
      </p>
      <p> 9. 进行与您或交易对方宣称的内容不符的交易或不真实的交易；
      </p>
      <p> 10. 从事任何可能侵害比财服务系統的行为；
      </p>
      <p> 11. 其他违法行为或比财有正当理由认为不适当的行为。
      </p>
      <h4>七、不可抗力</h4>
      <p> 因下列状况之一使您无法使用比财服务时，比财不承担任何责任：
      </p>
      <p> (一) 银行系统停机维护或升级;
      </p>
      <p> (二) 银行或电信设备出现故障不能进行数据传输的；
      </p>
      <p> (三) 因台风、地震、海啸、洪水、停电、战争或恐怖袭击等不可抗力因素，病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵或政府行为等原因，造成比财系统不能提供服务的;
      </p>
      <p> (四) 发生其他比财无法控制、无法预见或无法避免的情形.
      </p>
      <h4>八、责任范围及责任限制</h4>
      <p> (一) 比财仅对本协议中所列明的义务承担责任。
      </p>
      <p> (二) 您与任何第三方交易所产生的交易风险应由您自行承担。
      </p>
      <p> (三) 比财对您提供信息的合法性、真实性、准确性和完整性不承担任何责任。
      </p>
      <p> (四)比财不提供以下保证：
      </p>
      <p> 1.比财服务将符合您的全部需求。
      </p>
      <p> 2.您经由比财服务购买或取得的任何产品、服务、资讯或其他资料将符合您的期望。
      </p>
      <p> (五)比财的合作单位所提供的服务品质及内容由该合作单位自行负责。
      </p>
      <h4> 九、隐私权保护</h4>
      <p> 比财重视对用户隐私的保护，关于您的用户资料和其他特定资料依《比财隐私政策》受到保护与规范，详情请参阅《比财隐私政策》。
      </p>
      <h4> 十、比财服务软件形式
      </h4>
      <p> 若比财依托软件向您提供比财服务，您还应遵守以下约定：</p>
      <p> (一)
        比财可能为手机端、移动设备端以及其他终端设备开发不同的软件版本，包括可能在手机端基于手机QQ、微信、比财或第三方合作机构现在或将来可能开发的软件上(简称“本软件”)提供比财服务；为正常使用比财服务，您应当根据实际需要选择并下载合适的软件版本。
      </p>
      <p> (二) 如果您从未经合法授权的第三方获取本软件或与本软件名称相同的安装程序，比财将无法保证该软件能正常使用。
      </p>
      <p> (三)
        为了提升用户体验、完善服务内容，比财可能将不时提供软件更新服务(该更新可能会采取软件替换、修改、功能强化、版本升级等形式)。为了改善用户体验，保证服务的安全性和功能的一致性，比财有权随时对软件进行更新或者对软件的部分功能效果进行改变或限制。
      </p>
      <p> (四) 软件新版本发布后，旧版软件可能无法使用。比财不保证旧版软件继续可用及相应的客户服务，请您随时核对并下载最新版本。
      </p>
      <p> (五) 除非法律允许或比财书面许可，您不得从事下列行为：
      </p>
      <p> 1. 删除软件及其副本上关于著作权的信息；
      </p>
      <p> 2. 对软件进行反向工程、反向汇编、反向编译或者以其他方式尝试发现软件的源代码；
      </p>
      <p> 3. 对比财拥有知识产权或获得授权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
      </p>
      <p> 4.
        对软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经合法授权的第三方工具/服务接入软件和相关系统；
      </p>
      <p> 5. 修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论上述行为是否为商业目的；
      </p>
      <p> 6. 通过非比财开发、授权的第三方软件、插件、外挂、系统使用比财服务，或制作、发布、传播非比财开发、授权的第三方软件、插件、外挂、系统；
      </p>
      <p> 7. 其他未经比财明示授权的行为。
      </p>
      <h4>十一、知识产权的保护</h4>
      <p> (一)比财客户服务渠道上所有内容以及使用比财服务过程中的内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由比财或其他权利人依法拥有其知识产权，包括商标权、专利权、著作权和商业秘密等。
      </p>
      <p>
        (二)您在使用比财服务的过程中可能需要下载比财拥有原始权利或获得授权的比财提供的软件，对于这些软件，比财授予您一项不可转让、非独占及非排他性的使用许可。您仅可为访问比财客户服务渠道或使用比财服务的目的而使用这些软件。除另有特别声明外，比财提供比财服务时所依托软件的著作权、专利权及其他知识产权均归比财或其他原始权利人所有。
      </p>
      <p> (三)非经比财或其他权利人书面同意，任何人不得擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表上述内容及软件。
      </p>
      <p> (四)尊重知识产权是您应尽的义务，如有违反，您应对比财或其他权利人承担损害赔偿责任。
      </p>
      <h4>十二、第三方软件或技术</h4>
      <p> (一)本软件可能会使用第三方软件或技术(包括本软件可能使用的开源代码和公共领域代码等，下同)，这种使用已经获得合法授权。
      </p>
      <p>
        (二)本软件如果使用了第三方的软件或技术，比财将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本软件安装包特定文件夹中打包等形式进行展示，它们可能会以"软件使用许可协议"、“授权协议"、“开源代码许可证"或其他形式来表达。前述通过各种形式展现的相关协议或其他文件，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求比财给予协助，您应当自行承担法律责任。
      </p>
      <h4>十三、完整协议</h4>
      <p>
        (一)本协议由本协议条款与比财现在及将来公示的关于比财服务的变更条款、单项协议或规则、操作时的提示等组成，相关名词可互相引用参考。如本协议条款与上述各变更条款、单项协议或规则、操作提示等另行约定的内容相冲突或不致，则应以各变更条款、单项协议或规则、操作提示等另行约定的内容为准。
      </p>
      <p> (二)本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对您和比财均具有约束力。
      </p>
      <p> (三)本协议的任何译文版本仅为方便用户而提供，无意对本协议的条款进行修改。如果本协议的中文版本与非中文版本之间存在冲突，应以中文版本为准。
      </p>
      <h4>十四、法律适用及争端解决</h4>
      <p> (一)本协议的生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
      </p>
      <p> (二)本协议签订地为中华人民共和国北京市朝阳区。
      </p>
      <p> (三)若您和比财发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地(即中国北京市朝阳区)有管辖权的人民法院管辖。
      </p>
      <h4>十五、交易风险提示</h4>
      <p> (一)您承诺在通过比财客户服务渠道进行网上交易之前，对网上交易有了一定的了解，并充分知悉网上交易过程中可能蕴含的风险。
      </p>
      <p> (二)您了解，您与交易对手或其他任何第三方之间因网上交易可能发生的包括但不限于产品或服务质量等纠纷及损失应由您独立担责，比财对于您在使用比财服务时进行的交易均不提供任何担保，也不保证任何收益(比财与您另有约定的除外)。
      </p>
      <p> (三)您对比财所提示的风险和列示措施、说明完全理解和同意，自愿承担交易风险以及交易过程中可能产生的损失。
      </p>
      <p>
        (四)您了解并承诺，您不得使用比财提供的服务进行任何形式的洗钱、虚假交易、资金非法套现及其它违法犯罪行为。若比财发现您有上述违法违规行为的，比财有权立即暂停、中止或终止相关交易，向公安部门报案，并将相关信息报送有关部门及银行业或支付服务行业内部风险信息系统。
      </p>
      <h4>十六、其他</h4>
      <p> 如果您对本协议或比财服务有意见或建议，可与比财客户服务部门联系(联系电话:010-61841811)，我们会给予您必要的帮助。
      </p>

      <p>北京比财数据科技有限公司</p>
      <p>2018 年6月25日</p>

    </div>
    <div class="docs-box" v-if="type=='bicaisafe'">
      <h1>北京比财数据科技有限公司隐私政策</h1>
      <h3>(V1.0版)</h3>
      <h4>重要提示：</h4>
      <p>
        北京比财数据科技有限公司(以下简称”比财”或“我们”)重视保护用户(以下可简称“您”)的隐私。比财依据《北京比财数据科技有限公司隐私政策》(以下简称“本政策”)的约定为用户提供服务，本政策在用户和比财间具有合同上的法律效力。比财在此特别提醒用户认真阅读、充分理解本政策各条款特别是其中所涉及的免除、限制比财责任的条款、对用户权利限制条款、管辖与法律适用条款等。为了特别提示您限制、免责条款以及涉及到您的权益的等内容，这些条款可能以字体加粗形式提示您注意。请用户审慎阅读本政策(未成年人应在监护人陪同下阅读)。当您同意《北京比财数据科技有限公司隐私政策》时，或访问比财网站http://www.bicai365.com/，下同)及其相关网站、或是下载、安装、使用比财相关客户端时，或您通过比财其它自有客户服务渠道、第三方机构合作渠道等使用我们提供的任一服务(以下可统称为“比财服务”)时，即表示您已同意我们按照本政策收集、储存、使用和分享您的信息。除非您已阅读并接受本政策所有条款，否则您无权使用比财服务。
      </p>
      <h4> 引言
      </h4>
      <p> 1.
        个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。包括姓名、出身日期、身份证件号码、个人生物识别信息、住址、通信通讯地址及联系方式、通信记录和内容、账号密码、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息等。
      </p>
      <p> 2.
        个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。包括身份证件号码、个人生物识别信息、银行账号、通信记录和内容、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息、14岁以下(含)儿童的个人信息等。
      </p>
      <p> 3. 在您使用比财服务时，我们可能会收集、储存、使用和分享您的相关个人信息。我们通过本政策向您说明，我们如何收集、储存、使用和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。
      </p>
      <p> 4. 基于国家相关法律法规的规定，以及为向您提供服务及提升服务质量、向您提供安全、顺畅、高效和个性化的体验的目的(包括支持我们开发新产品或完善已有产品功能)，我们按照本政策收集、储存、使用和分享您的信息。
      </p>

      <h4> 本政策将帮助您了解以下内容：
      </h4>
      <p> 一、我们可能如何收集个人信息及收集信息的范围
      </p>
      <p> 二、我们如何使用 Cookie和同类技术
      </p>
      <p> 三、我们如何保护和存储信息
      </p>
      <p> 四、您的权利
      </p>
      <p> 五、我们可能如何使用信息
      </p>
      <p> 六、我们可能如何分享信息
      </p>
      <p> 七、适用范围
      </p>
      <p> 八、管辖与法律适用
      </p>
      <p> 九、其他
      </p>
      <h4> 一、我们可能如何收集个人信息及收集信息的范围</h4>
      <h5> 1.我们可能会通过以下方式和途径收集您的信息：
      </h5>
      <p> (1)当您使用比财服务时，我们会收集您通过计算机、手机或其他接入设备发送给我们的信息，我们也可能会从比财的关联公司或其他第三方获得您的信息。
      </p>
      <p>
        (2)您将第三方管理的账户与您的比财账户相关联，并授权比财访问此类信息，表示您同意比财在遵守本政策的许可下，收集、存储、使用和分享此类信息。例如，我们可以根据您的授权收集您通过社交媒体网站或社交工具软件等途径提供的信息。我们通过此种途径收到的信息因具体提供的网站而异并受提供信息的网站控制。
      </p>
      <p> (3)我们还可能会以其他方式收集有关您的其他信息，例如通过您与我们的客户服务团队联系收集您的信息、当您对调查做出答复时收集相关结果。
      </p>
      <h5> 2.为了遵守国家相关法律法规的规定，以及为向您提供服务及提升服务质量、向您提供安全、顺畅、高效和个性化的体验的目的，我们收集的信息范围主要包括以下内容:
      </h5>
      <p>
        (1)当您在注册、使用比财账户或比财服务时，为了符合相关金融法规政策要求及产品/服务正常使用要求，我们会收集您的个人敏感信息：如QQ号码、微信号、手机号码或电子邮箱、真实姓名、证件号码、身份证照片、脸部信息或是我们要求您提供的其他信息(包括但不限于银行卡号)。我们通过这些信息识别您的身份，为您提供服务。
      </p>
      <p>
        (2)当您使用的比财服务需与您的银行账户等账户关联方能实现时，我们会收集您的银行卡卡号、绑定手机号等个人敏感信息。无法收集此类信息将导致我们不能为您提供正常服务。例如，您在开通比财账户，将您的银行卡与比财账户绑定时，您需向我们提供您的银行卡信息。
      </p>
      <p>
        (3)当您使用比财服务进行交易时，我们会收集交易过程中所产生的支付及交易信息，包括但不限于交易双方名称、交易金额、交易时间、交易双方的开户银行名称、银行账户号码等相关个人敏感信息。您可以通过我们查询您的支付状态或历史交易记录。
      </p>
      <p> (4)我们可能会收集您使用比财服务的相关操作信息，包括但不限于您的硬件设备型号、您所使用的软件版本信息、您的IP地址、您所在的位置、移动网络信息、标准网络日志数据和其他信息，以尽最大努力保护您的账户安全。
      </p>
      <p> (5)如比财为了提供附加功能，需要收集您更多的个人信息时，会向您说明收集的必要性，征求您的同意；若您拒绝提供，比财将不予提供相应的附加功能，但比财为您提供的核心业务功能不受影响。
      </p>
      <h4> 二、我们如何使用 Cookie和同类技术
      </h4>
      <p>
        为确保您正常使用比财的服务，我们可能会保存您的用户登录状态并且为您分配一个或多个Cookie(一个小文本文件)。例如：当用户访问一个需要用户登录才可以提供的信息或服务，当用户登录时，我们会把该用户的登录状态加密存储在用户移动端的
        Cookie文件中。</p>
      <p> Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，可能帮助您省去为使用比财服务而重复登录。
      </p>
      <p> 我们不会将 Cookie用于本政策所述目的之外的任何用途。
      </p>
      <h4> 三、我们如何保护和存储信息
      </h4>
      <p> 1.我们在法律法规等相关规定要求的时限内收集和存储您的信息，并依法对这些信息进行严格保密。
      </p>
      <p>
        2.为了保障您的信息安全，比财会在现有技术水平下采取合理必要的措施来保护您的信息，采取物理、技术和行政管理安全措施来降低丢失、误用、非授权访问、披露和更改的风险，包括但不限于传输层数据加密、防火墙和加密存储、物理访问控制以及信息访问授权控制。为此我们设置了安全程序保护您的信息不会被未经授权的访问所窃取，保证您个人信息的完整、可用，并处于最新状态。所有的个人信息被加密储存并放置于专业防火墙内并请您理解且明白，由于存在的各种各样的恶意手段，即便比财尽力采取上述措施，您的信息仍有可能被泄漏、毁损或灭失。我们对此不承担任何承诺或保证，也对此不负任何责任。
      </p>
      <p> 3.您应审慎使用比财服务，并妥善保护好您的个人信息。
      </p>
      <p>
        4.您在使用比财服务时，请妥善保管好您的比财账号及其密码，我们会通过您的账号及其密码来识别您的身份。一旦您泄漏了比财账号及其密码，您可能会丢失您的信息，并可能产生对您不利的法律后果。如您发现您的账号及其密码因任何原因已经或将受到泄漏时，您应该立即和我们取得联系，但在我们知悉此种情况和采取行动前，我们对此不负任何责任。
      </p>
      <p> 5.您可以随时登录自己的账户查看或根据系统要求修改账户设置和信息，但出于安全性和身份识别等方面的考虑，身份证件等敏感信息可能进行部分掩码隐藏，同时，您可能无法修改注册或激活时提供的某些信息。
      </p>
      <p>
        若发生个人信息安全事件，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以电话、短信或推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理有效的方式发布公告。
      </p>
      <p> 同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
      </p>
      <h4> 四、您的权利
      </h4>
      <p> 比财非常重视您对个人信息的关注，并尽全力保护您对于您个人信息访问、更正、删除以及撤回同意的权利，以使您拥有充分的能力保障您的隐私和安全。您的权利包括：
      </p>
      <h5>1.访问和更正您的个人信息</h5>
      <p> 除法律法规规定外，您有权随时访问下述您的个人信息并随时更正其中的部分信息，具体包括:
      </p>
      <p> (1) 账户信息：进入个人信息设置访问/更正绑定账号、手机号码、职业、地址；
      </p>
      <p> 邮箱安全信息：进入安全设置访问/更正密码安全、转账设置、消费设置；
      </p>
      <p> 账户安全银行卡：管理我的银行卡添加银行卡/点击“具体银行卡”进入设置-访问/解绑银行卡信息。
      </p>
      <p> (2) 查询您的交易信息交易记录：进入“交易查询”访问/查询历史记录信息。
      </p>
      <p> (3) 我们还可能会以其他方式收集有关您的其他信息，例如通过您与我们的客户服务团队联系收集您的信息、当您对调查做出答复时收集相关结果。
      </p>
      <p> (4)
        您无法访问和/或更正的个人信息：除上述列明的信息外，您的部分个人信息我们还无法为您提供访问和/或更正的服务，这些信息主要是为了保证交易安全满足相关强制性法律法规要求所收集的您的设备信息、您使用金融产品时产生的个人信息。上述信息我们会在您的授权范围内按照相关法律法规的规定进行使用，您无法变更或自主删除。
      </p>
      <h5> 2. 删除您的个人信息
      </h5>
      <p> 您在我们的产品页面中可以直接清除或删除的信息，包括绑定银行卡等。
      </p>
      <p> 在以下情形中，您可以向我们提出删除个人信息的请求:
      </p>
      <p> (1) 我们处理个人信息的行为违反法律法规；
      </p>
      <p> (2) 我们未征得您的同意即收集、使用您的个人信息;
      </p>
      <p> (3) 我们处理个人信息的行为违反了与您的约定;
      </p>
      <p> (4) 我们终止服务及运营。
      </p>
      <p> 若我们决定响应您的删除请求，我们会根据您的要求及相关法律法规的要求进行后续删除处理并向您进行结果反馈。
      </p>
      <h5> 3.改变您授权同意的范围或撤回您的授权
      </h5>
      <p> 您可以通过删除信息、关闭设备功能、在比财软件中进行设置等方式改变部分您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销账户的方式，撤回我们继续收集您个人信息的全部授权。
      </p>
      <p> 请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撒回同意或授权所对应的服务。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。
      </p>
      <h5> 4.注销
      </h5>
      <p>
        您可以在比财官方公众号中回复销户后按照指示操作注销账户，也可以前往比财集中作业室(北京市朝阳区酒仙桥路甲16号将台新港中心4层G)申请注销账户或删除您申请的具体比财服务功能。您注销账户后，我们将停止为您提供产品与/或服务，并依据相关法律法规的要求处理您的个人信息。
      </p>
      <h4> 五、我们可能如何使用信息
      </h4>
      <p> 如上所述，基于国家相关法律法规的规定，以及为向您提供服务及提升服务质量、向您提供安全、顺畅、高效和个性化的体验的目的(包括支持我们开发新产品或完善已有产品功能)，您同意我们可能将收集的您的相关信息用作下列用途:
      </p>
      <p> 1.向您提供比财服务；
      </p>
      <p> 2.基于国家相关主管部门的要求向相关部门进行报告；
      </p>
      <p> 3.在您使用比财服务时，我们将您的信息用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
      </p>
      <p> 4.帮助我们设计新产品及服务，改善我们现有服务；
      </p>
      <p> 5.使我们了解您如何接入和使用比财服务，从而满足您的个性化需求；
      </p>
      <p> 6.为了使您了解比财服务的具体情况，您同意我们向您发送营销活动通知、商业性电子信息以及提供与您相关的广告以替代普遍投放的广告，如您在体验过程中不希望再接收到前述营销广告信息或商业性信息，可按照信息中的提示予以退订取消;
      </p>
      <p> 7.评估比财服务中的相关广告和其他促销及推广活动的效果，并加以改善;
      </p>
      <p> 8.开展市场调查与信息数据分析；
      </p>
      <p> 9.软件认证或管理软件升级；
      </p>
      <p> 10.邀请您参与有关我们产品和服务的调查;
      </p>
      <p> 11.经您授权的其他用途。
      </p>
      <p>
        为了您能享受到更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。当我们要将信息用于本政策未载明的其它用途时，会事先征求您的同意。当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。
      </p>
      <h4>
        六、我们可能如何分享信息
      </h4>
      <h5> (一) 共享
      </h5>
      <p> 我们依国家相关法律法规及本政策的约定保护和存储您的信息，在下列情况下，我们可能会将您的信息与第三方分享:
      </p>
      <p>
        1.当您通过第三方使用比财服务时，我们也可能会基于为您提供服务的目的与第三方分享您的一些信息，您同意我们与第三方之间可分享您的信息。我们与第三方之间会签署相关法律文件，我们会尽力去要求第三方按照本隐私政策及任何相关的安全和保密措施对您的信息釆取保护措施。但我们无法保证第三方一定会按照比财的要求采取保护措施，比财对此不作任何承诺与保证。
      </p>
      <p> 2.当您通过比财账号登录第三方客户端或网站时，为了您能够方便快捷地使用第三方客户端或网站，我们可能会将您的信息分享给第三方。该第三方按照其与您的相关约定或其独立的隐私政策等内容处理您的信息，比财对此不承担责任。
      </p>
      <p>
        3.我们提供的某些服务和(或)产品功能可能由我们的合作伙伴提供或由我们与合作伙伴共同提供，只有您同意将信息分享给该第三方，您才能使用上述比财服务。4.我们可能与合作伙伴合作举办营销活动，并与其分享活动过程中产生的、为完成活动所必要的一些信息，以便您能参与活动且我们的合作伙伴能及时与您联系、发放奖品等。
      </p>
      <p> 5.根据法律法规的规定、有权机关的要求或是经您同意。
      </p>
      <p> 6.您与比财关于信息分享的其他约定。
      </p>
      <h5> (二)转让
      </h5>
      <p> 我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
      </p>
      <p> 1.事先获得您明确的同意或授权；
      </p>
      <p> 2.根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供；
      </p>
      <p> 3.在涉及合并、收购、资产转让或类似的交易时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
      </p>
      <h5> (三)公开披露
      </h5>
      <p> 我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会公开披露您的个人信息：
      </p>
      <p> 1.根据您的要求，在您明确同意的披露方式下披露您所指定的信息；
      </p>
      <p>
        2.根据法律、法规的要求，强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可能会依据所要求的个人信息类型和披露方式披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。
      </p>

      <h4>七、适用范围</h4>
      <p> 1.除您在使用比财服务时与比财就个人信息的收集、使用等有另行约定或国家金融政策法规对个人信息收集、使用等有另行规定外，本政策适用于您使用的所有比财服务。
      </p>
      <p> 2.如果您在使用比财服务的过程中还会使用到第三方的产品或服务，请您遵守第三方的相关隐私政策或规定。例如，您与其进行交易的商户可能会有自己的隐私保护政策，比财对他们的行为(包括其隐私政策)不承担任何责任。</p>
      <h4>八、管辖与法律适用</h4>
      <p> 1.本政策的生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。</p>
      <p>2.本协议签订地为中华人民共和国北京市朝阳区。</p>
      <p> 3.若您与我们之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您同意将纠纷或争议提交本协议签订地(即北京市朝阳区)有管辖权的人民法院管辖。</p>
      <h4> 九、其他</h4>
      <p> 1.本政策所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本政策涵义解释的依据。
      </p>
      <p> 2.本政策条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
      </p>
      <p>
        3.为给您提供更好的服务并随着比财业务的调整、发展，本隐私政策也会随之更新。但未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在比财移动客户端上发出更新版本并在生效前通过公告或以其他适当方式提醒您相关内容的更新，也请您访问比财以便及时了解最新的隐私政策。
      </p>
      <p> 4如您对本政策存在任何疑问，或任何相关的投诉、意见，请联系我们的客服部门(联系电话010-61841811)。
      </p>
    </div>
    <div class="iframs-docs" v-if="agreeMentSrc">
      <h1 v-if="title">{{title}}</h1>
      <iframe :src="agreeMentSrc" class="indocs"></iframe>
    </div>
    <div class="btn">
      <button @click="getCode">确认</button>
    </div>
  </div>
</template>
<script>
  import API from "@/service";
  import {HOST_API} from "@/Constant";

  export default {
    name: "DocsPage",
    data() {
      return {
        docs: '',
        agreeMentSrc: '',
        title: ''
      }
    },
    created() {
      let type = this.$route.query.type
      this.getAgreement(type)

    },
    methods: {
      getAgreement(type) {
        this.type = type
        if (type == 'user') {
          this.getBicaiAgreementByAjax('1', 'user')
        }
        if (type == 'bicaisafe') {
          this.getBicaiAgreementByAjax('1', 'bicaisafe')
          // this.agreeMentSrc = HOST_API + '/static/finsuit/bank/zzh/cz.html'
        }
        if (type == 'open') {
          this.getOpenAgreementByAjax()
        }
        if (type == 'redeem') {
          this.getRedeemAgreementByAjax()
        }
      },
      getRedeemAgreementByAjax() {
        // TODO
        let redeem = this.getComState.redeemData
        let data = {
          // USER_NAME	身份证姓名
          // ACCOUNT	账号众邦二类户
          // TRADE_DATE	交易日期
          // DATE_VALUE	每笔交易起息日期
          // AMOUNT_PURCHASE	每笔购买金额
          USER_NAME: this.redeem.USER_NAME,
          ACCOUNT: this.redeem.BANK_USER_CODE,
          TRADE_DATE: '',
          DATE_VALUE: '',
          AMOUNT_PURCHASE: ''
        }
        API.doc.fixedTimeDepositAgreement(data)
      },
      getBicaiAgreementByAjax(type, docs) {
        let data = {
          InterfaceType: type
        }
        return
        API.bicai.getDocs(data, res => {
          if (docs == 'user') {
            this.TITLE = res[1].TITLE
            this.docs = res[1].HTML_TEXT
          }
          if (docs == 'bicaisafe') {
            this.TITLE = res[0].TITLE
            this.docs = res[0].HTML_TEXT
          }

        })
      },
      getOpenAgreementByAjax() {
        let data = {}
        API.doc.electronicAccountAgreement(data, res => {
          this.title = res.AGREEMENT
          this.agreeMentSrc = HOST_API + res.URL
        })
      },
      // getReCha
      cancel() {
        this.$router.go(-1)
      },
      getCode() {
        this.$router.go(-1)
      },

    }
  }
</script>

<style lang="scss" scoped>
  @import "~@/assets/px2rem";

  .page {
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background: #fff;
    z-index: 100;
    box-sizing: border-box;

    h1 {
      text-align: center;
    }

    .docs {
      box-sizing: border-box;
      padding: 0 px2rem(10);
      width: 100%;
      height: 90%;
      overflow-y: scroll;
      -webkit-overflow-scrolling: touch;
    }

    .iframs-docs {
      box-sizing: border-box;
      padding: 0 px2rem(10);
      width: 100%;
      height: 90%;
      overflow-y: scroll;
      -webkit-overflow-scrolling: touch;

      .indocs {
        border: none;
        width: 100%;
        height: 100%;
      }
    }

    .btn {
      padding-top: .2rem;
      text-align: center;

      button {
        background: #007aff;
        width: px2rem(100);
        height: px2rem(40);
        color: #fff;
      }
    }
  }

  .docs-box {

    padding: px2rem(20);
    font-size: px2rem(16);
    h2,h3,h4,h5{
      margin: px2rem(10) 0;
    }
    h1{
      font-size: px2rem(20);
    }
  }
</style>
